tap "homebrew/bundle"
tap "railwaycat/emacsmacport"
brew "bat"
brew "direnv"
brew "eza"
brew "fish"
brew "fisher"
brew "ghq"
brew "git"
brew "mise"
brew "peco"
brew "tmux"
cask "alacritty"
cask "aws-vpn-client"
cask "emacs-mac"
cask "font-plemol-jp"
cask "iterm2"
cask "warp"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "connorshea.vscode-ruby-test-adapter"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "groksrc.ruby"
vscode "haskell.haskell"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "hidenba.open-junkfile"
vscode "humao.rest-client"
vscode "jebbs.plantuml"
vscode "johnpapa.vscode-peacock"
vscode "justusadam.language-haskell"
vscode "kahole.magit"
vscode "kaiwood.endwise"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "noku.rails-run-spec-vscode"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "panicbit.cargo"
vscode "ritwickdey.liveserver"
vscode "rubocop.vscode-rubocop"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sjurmillidahl.ormolu-vscode"
vscode "skyapps.fish-vscode"
vscode "sporto.rails-go-to-spec"
vscode "statiolake.vscode-rustfmt"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "vayan.haml"
vscode "vue.volar"
