fisherman/await
fisherman/enhancd
oh-my-fish/plugin-exenv
fisherman/fzf
fisherman/get
fisherman/getopts
decors/fish-ghq
fisherman/last_job_id
