oh-my-fish/plugin-balias
oh-my-fish/theme-clearance
fisherman/getopts
decors/fish-ghq
hasanozgan/theme-lambda
oh-my-fish/plugin-peco
fisherman/rbenv
fisherman/z
